Configuration/src/Documents/GoodsReceipt/GoodsReceipt.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>GoodsReceipt</name>
  <registerRecords>AccumulationRegister.BalanceOfMaterials</registerRecords>
  <registerRecords>AccumulationRegister.CostOfMaterials</registerRecords>
  <registerRecords>AccountingRegister.Primary</registerRecords>
  <attributes>
    <name>Warehouse</name>
    <type>
      <types>CatalogRef.Warehouse</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Materials</name>
    <attributes>
      <name>Material</name>
      <type>
        <types>CatalogRef.MaterialsAndServices</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Total</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PropertySet</name>
      <type>
        <types>CatalogRef.MaterialOptions</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Configuration/src/AccumulationRegisters/BalanceOfMaterials/BalanceOfMaterials.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>BalanceOfMaterials</name>
  <resources>
    <name>Quantity</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Material</name>
    <type>
      <types>CatalogRef.MaterialsAndServices</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Warehouse</name>
    <type>
      <types>CatalogRef.Warehouse</types>
    </type>
  </dimensions>
  <dimensions>
    <name>PropertySet</name>
    <type>
      <types>CatalogRef.MaterialOptions</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Configuration/src/AccumulationRegisters/CostOfMaterials/CostOfMaterials.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>CostOfMaterials</name>
  <resources>
    <name>Cost</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Material</name>
    <type>
      <types>CatalogRef.MaterialsAndServices</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Configuration/src/AccountingRegisters/Primary/Primary.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Primary</name>
  <chartOfAccounts>ChartOfAccounts.Main</chartOfAccounts>
  <correspondence>true</correspondence>
  <resources>
    <name>Sum</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
  </resources>
  <resources>
    <name>Quantity</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Main.AccountingFlag.Quantitative</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Main.ExtDimensionAccountingFlag.Quantitative</extDimensionAccountingFlag>
  </resources>
</mdclass:AccountingRegister>

Configuration/src/ChartsOfAccounts/Main/Main.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>Main</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ExtraDimensionTypes</extDimensionTypes>
  <predefined>
    <items>
      <name>AccountsReceivable</name>
      <description>Accounts receivable</description>
      <code>2000</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>AccountsPayable</name>
      <description>Accounts payable</description>
      <code>4000</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>Inventory</name>
      <description>Inventory</description>
      <code>5000</code>
    </items>
    <items>
      <name>Income</name>
      <description>Income</description>
      <code>9000</code>
      <accountType>ActivePassive</accountType>
    </items>
  </predefined>
  <accountingFlags>
    <name>Quantitative</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <extDimensionAccountingFlags>
    <name>Quantitative</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
</mdclass:ChartOfAccounts>

Configuration/src/Documents/GoodsReceipt/ObjectModule.bsl
Procedure Posting(Cancel, Mode)
	//{{__REGISTER_REGISTERRECORDS_WIZARD
	// This fragment was built by the wizard.
	// Warning! All manually made changes will be lost next time you use the wizard.
	
	RegisterRecords.BalanceOfMaterials.Write = True;  
	
	RegisterRecords.CostOfMaterials.Write = True;
	
	RegisterRecords.Primary.Write = True;
	
	For Each CurRowMaterials In Materials Do 
		// register BalanceOfMaterials Receipt
		
		Record = RegisterRecords.BalanceOfMaterials.Add();
		Record.RecordType = AccumulationRecordType.Receipt;
		Record.Period = Date;
		Record.Material = CurRowMaterials.Material;
		Record.Warehouse = Warehouse;
		Record.Quantity = CurRowMaterials.Quantity; 
		Record.PropertySet = CurRowMaterials.PropertySet;
		
		
		// register CostOfMaterials Receipt
		
		Record = RegisterRecords.CostOfMaterials.Add();
		Record.RecordType = AccumulationRecordType.Receipt;
		Record.Period = Date;
		Record.Material = CurRowMaterials.Material;
		Record.Cost = CurRowMaterials.Total;     
		
		// register Primary
		Record = RegisterRecords.Primary.Add();
		Record.AccountDr = ChartsOfAccounts.Main.Inventory;
		Record.AccountCr = ChartsOfAccounts.Main.AccountsPayable;
		Record.Period = Date;
		Record.Sum = CurRowMaterials.Total;  
		Record.QuantityDr = CurRowMaterials.Quantity;
		Record.ExtDimensionsDr[ChartsOfCharacteristicTypes.ExtraDimensionTypes.Materials] = CurRowMaterials.Material;
	EndDo;
	
	//}}__REGISTER_REGISTERRECORDS_WIZARD
EndProcedure

Procedure OnSetNewNumber(StandardProcessing, Prefix)
	Prefix = Exchange.GetNumberingPrefix();
EndProcedure
